tutorials/quick-start-lithium-fluoride.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-15 Mon 12:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Quick Start: Periodic LiH calculation using VASP</title>
<meta name="generator" content="Org mode" />

    <meta charset='UTF-8'>
    <meta name='apple-mobile-web-app-capable' content='yes'>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <link
      href='https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css'
      rel='stylesheet'
      integrity='sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU'
      crossorigin='anonymous'>
</head>
<body>
<div id="preamble" class="status">

  <nav class='navbar navbar-expand-lg navbar-light bg-light'>
    <div class='container-fluid'>
      <a class='navbar-brand' href='#'>
        Cc4s
      </a>
      <button class='navbar-toggler' type='button'
              data-bs-toggle='collapse'
              data-bs-target='#navbarSupportedContent'
              aria-controls='navbarSupportedContent'
              aria-expanded='false'
              aria-label='Toggle navigation'>
        <span class='navbar-toggler-icon'></span>
      </button>
      <div class='collapse navbar-collapse' id='navbarSupportedContent'>
        <ul class='navbar-nav me-auto mb-2 mb-lg-0'>
          <li class='nav-item'>
            <a class='nav-link' aria-current='page' href='/user-manual/index.html'>
              <i class='fa fa-home'></i>
              Home
            </a>
          </li>
          <li class='nav-item'>
            <a class='nav-link' href='/user-manual/sitemap.html'>
              <i class='fa fa-sign-out'></i>
              Sitemap
            </a>
          </li>
        </ul>
      </div>
    </div>
  </nav>
</div>
<div id="content">
<h1 class="title">Quick Start: Periodic LiH calculation using VASP</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0ce5f6a">1. Introduction</a></li>
<li><a href="#org9c736bc">2. <span class="todo TODO">TODO</span> DFT Calculation</a></li>
<li><a href="#org5114732">3. <span class="todo TODO">TODO</span> Hartree-Fock calculation</a></li>
<li><a href="#org3910281">4. <span class="todo TODO">TODO</span> Full Space Diagonalization</a></li>
<li><a href="#orgad13bcd">5. <span class="todo TODO">TODO</span> <code>CC4S</code> dumping</a></li>
<li><a href="#orgf3077e9">6. <span class="todo TODO">TODO</span> Cc4s Calculation</a>
<ul>
<li><a href="#orgd0b15b1">6.1. Reading in</a></li>
<li><a href="#orgf870038">6.2. CCSD and CCSD(T)</a></li>
</ul>
</li>
<li><a href="#org2c1c8c1">7. Putting all together</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0ce5f6a" class="outline-2">
<h2 id="org0ce5f6a"><span class="section-number-2">1.</span> <a href="#org0ce5f6a">Introduction</a></h2>
<div class="outline-text-2" id="text-1">
<p>
In this tutorial we are going to present a simple application
of <code>cc4s</code> by performing a <code>CCSD</code> and <code>CCSD(T)</code> calculation
of a LiH crystal.
</p>

<p>
For this, we will utilize the <a href="https://www.vasp.at"><code>VASP</code></a> interface that is included
in <code>cc4s</code>. Please note that you should be moderately experienced
in <code>VASP</code> to follow along.
</p>

<p>
The atomic structure of the system is given by the <code>POSCAR</code> file
</p>

<p>
&lt;poscar&gt;=
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org210930e">Li4 H4
1.0
4.000174 0.000000 0.000000
0.000000 4.000174 0.000000
0.000000 0.000000 4.000174
Li H
4 4
direct
0.000000 0.000000 0.000000
0.000000 0.500000 0.500000
0.500000 0.000000 0.500000
0.500000 0.500000 0.000000
0.500000 0.000000 0.000000
0.500000 0.500000 0.500000
0.000000 0.000000 0.500000
0.000000 0.500000 0.000000
</pre>
</div>

<p>
This example uses a \( \Gamma \)-only version of <code>VASP</code>, this means
that we use a single \( k \)-point, i.e., the \( \Gamma \) point.
In particular the Coulomb integrals are therefore real valued.
The <code>KPOINTS</code> file is thus
</p>

<p>
&lt;kpoints&gt;=
</p>
<div class="org-src-container">
<pre class="src src-sh" id="orgf02b88f">Gamma Point Mesh
       0
gamma
 1 1 1
</pre>
</div>
</div>
</div>



<div id="outline-container-org9c736bc" class="outline-2">
<h2 id="org9c736bc"><span class="section-number-2">2.</span> <a href="#org9c736bc"><span class="todo TODO">TODO</span> DFT Calculation</a></h2>
<div class="outline-text-2" id="text-2">
<p>
&lt;dft-incar&gt;=
</p>
<div class="org-src-container">
<pre class="src src-sh" id="orgdb47799">ENCUT = $<span style="font-weight: bold; font-style: italic;">enc</span>
EDIFF = 1E-6
</pre>
</div>
</div>
</div>


<div id="outline-container-org5114732" class="outline-2">
<h2 id="org5114732"><span class="section-number-2">3.</span> <a href="#org5114732"><span class="todo TODO">TODO</span> Hartree-Fock calculation</a></h2>
<div class="outline-text-2" id="text-3">
<p>
A Hartree-Fock calculation is given by the following <code>INCAR</code>
input
</p>

<p>
&lt;hf-incar&gt;=
</p>
<div class="org-src-container">
<pre class="src src-sh" id="org3206bbe">ENCUT   = $<span style="font-weight: bold; font-style: italic;">enc</span>
EDIFF   = 1E-6
LHFCALC =.TRUE.
AEXX    = 1.0
ALGO    = C
</pre>
</div>
</div>
</div>


<div id="outline-container-org3910281" class="outline-2">
<h2 id="org3910281"><span class="section-number-2">4.</span> <a href="#org3910281"><span class="todo TODO">TODO</span> Full Space Diagonalization</a></h2>
<div class="outline-text-2" id="text-4">
<p>
&lt;hf-diagonalization-incar&gt;=
</p>
<div class="org-src-container">
<pre class="src src-sh" id="org3e41cec">ENCUT   = $<span style="font-weight: bold; font-style: italic;">enc</span>
EDIFF   = 1E-6
LHFCALC = .TRUE.
AEXX    = 1.0
ISYM    = -1
ALGO    = sub
NELM    = 1
NBANDS  = $<span style="font-weight: bold; font-style: italic;">nb</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgad13bcd" class="outline-2">
<h2 id="orgad13bcd"><span class="section-number-2">5.</span> <a href="#orgad13bcd"><span class="todo TODO">TODO</span> <code>CC4S</code> dumping</a></h2>
<div class="outline-text-2" id="text-5">
<p>
&lt;cc4s-incar&gt;=
</p>
<div class="org-src-container">
<pre class="src src-sh" id="org679c8d0">ENCUT      = $<span style="font-weight: bold; font-style: italic;">enc</span>
EDIFF      = 1E-6
LHFCALC    = .TRUE.
AEXX       = 1.0
ISYM       = -1
ALGO       = CC4S
NBANDS     = $<span style="font-weight: bold; font-style: italic;">nb</span>
NBANDSHIGH = $<span style="font-weight: bold; font-style: italic;">nb</span>
</pre>
</div>

<p>
this step the following files will be written that are needed for CC4S
</p>

<dl class="org-dl">
<dt>\(F_{pq}\)</dt><dd><code>FockOperator.yaml</code>, <code>FockOperator.dat</code></dd>
<dt>\(\vec G\)</dt><dd><code>GridVectors.yaml</code>, <code>GridVectors.dat</code></dd>
<dt>\(V(\vec G)\)</dt><dd><code>CoulombPotential.yaml</code>, <code>CoulombPotential.dat</code></dd>
<dt>\(\delta^{ab}_{ij}\)</dt><dd><code>DeltaPPHH.yaml</code>, <code>DeltaPPHH.dat</code></dd>
<dt>\(\delta_{ij}\)</dt><dd><code>DeltaHH.yaml</code>, <code>DeltaHH.dat</code></dd>
<dt>(no term)</dt><dd><code>CoulombVertexSingularVectors.yaml</code>, <code>CoulombVertexSingularVectors.dat</code></dd>
<dt>\(\Gamma^{pG}_{q}\)</dt><dd><code>CoulombVertex.yaml</code>, <code>CoulombVertex.dat</code></dd>
<dt>\(\epsilon_{p}\)</dt><dd><code>EigenEnergies.yaml</code>, <code>EigenEnergies.dat</code></dd>
<dt>(no term)</dt><dd><code>Spins.yaml</code>, <code>Spins.dat</code></dd>
</dl>
</div>
</div>


<div id="outline-container-orgf3077e9" class="outline-2">
<h2 id="orgf3077e9"><span class="section-number-2">6.</span> <a href="#orgf3077e9"><span class="todo TODO">TODO</span> Cc4s Calculation</a></h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgd0b15b1" class="outline-3">
<h3 id="orgd0b15b1"><span class="section-number-3">6.1.</span> <a href="#orgd0b15b1">Reading in</a></h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-yaml">- name: TensorReader
  in:
    fileName: "EigenEnergies.yaml"
  out:
    tensor: EigenEnergies

- name: TensorReader
  in:
    fileName: "CoulombVertex.yaml"
  out:
    tensor: CoulombVertex

- name: TensorReader
  in:
    fileName: "CoulombVertexSingularVectors.yaml"
  out:
    tensor: CoulombVertexSingularVectors

- name: TensorReader
  in:
    fileName: "GridVectors.yaml"
  out:
    tensor: GridVectors

- name: TensorReader
  in:
    fileName: "CoulombPotential.yaml"
  out:
    tensor: CoulombPotential
</pre>
</div>


<div class="org-src-container">
<pre class="src src-yaml">- name: DefineHolesAndParticles
  in:
    eigenEnergies: EigenEnergies
  out:
    slicedEigenEnergies: EigenEnergies

- name: SliceOperator
  in:
    slicedEigenEnergies: EigenEnergies
    operator: CoulombVertex
  out:
    slicedOperator: CoulombVertex
</pre>
</div>

<div class="org-src-container">
<pre class="src src-yaml">- name: CoulombIntegralsFromVertex
  in:
    slicedCoulombVertex: CoulombVertex
  out:
    coulombIntegrals: CoulombIntegrals
</pre>
</div>
</div>
</div>


<div id="outline-container-orgf870038" class="outline-3">
<h3 id="orgf870038"><span class="section-number-3">6.2.</span> <a href="#orgf870038">CCSD and CCSD(T)</a></h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-yaml">- name: CcsdEnergyFromCoulombIntegrals
  in:
    integralsSliceSize: 100
    slicedEigenEnergies: EigenEnergies
    coulombIntegrals: CoulombIntegrals
    slicedCoulombVertex: CoulombVertex
    maxIterations: 1
    energyConvergence: 1.0E-5
    amplitudesConvergence: 1.0E-5
    mixer:
      type: DiisMixer
  out:
    energy: CcsdEnergy
    amplitudes: Amplitudes

- name: StructureFactor
  in:
    amplitudes: Amplitudes
    slicedCoulombVertex: CoulombVertex
    coulombVertexSingularVectors: CoulombVertexSingularVectors
    coulombPotential: CoulombPotential
  out:
    structureFactor: SF
    deltaIntegrals: DeltaInt
    nij: Nij

- name: FiniteSizeCorrection
  in:
    gridVectors: GridVectors
    structureFactor: SF
  out:
    corrected: Corrected
    uncorrected: Uncorrected

- name: Atrip
  in:
    slicedEigenEnergies: EigenEnergies
    amplitudes: Amplitudes
    coulombIntegrals: CoulombIntegrals
  out:
    energy: AtripEnergy
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2c1c8c1" class="outline-2">
<h2 id="org2c1c8c1"><span class="section-number-2">7.</span> <a href="#org2c1c8c1">Putting all together</a></h2>
<div class="outline-text-2" id="text-7">
<p>
We can put all together in a compact script
that can serve as a starting point to test further variations.
You can find the full working script <a href="../data/run-simple-lih.sh">here</a>.
Schematically however, using the references above
you can write the following:
</p>

<div class="org-src-container">
<pre class="src src-C">#!/bin/bash


export OMP_NUM_THREADS=1

VASPBIN=<span style="font-style: italic;">"/home/fs71337/grueneis4/src/vasp-edge/bin/vasp_gam"</span>
CC4SBIN=<span style="font-style: italic;">"/home/fs71337/grueneis4/src/demo/cc4s/build/icc_impi/bin/Cc4s"</span>
NTASKS=48 # number of processes
VASP=<span style="font-style: italic;">"mpirun -machinefile machinefile -np $NTASKS $VASPBIN"</span>
CC4S=<span style="font-style: italic;">"mpirun -machinefile machinefile -np $NTASKS $CC4SBIN"</span>

enc=150 # ENCUT   <span style="font-weight: bold;">for</span> the whole calculation
egw=100 # ENCUTGW <span style="font-weight: bold;">for</span> the whole calculation


cat &lt;&lt;EOF | tee POSCAR
&lt;&lt;poscar&gt;&gt;
EOF

cat &lt;&lt;EOF | tee KPOINTS
&lt;&lt;kpoints&gt;&gt;
EOF

test -f WAVECAR &amp;&amp; rm WAVECAR

cat &lt;&lt;EOF | tee INCAR
#              =======================================
<span style="font-weight: bold;">#              RUN</span> DFT to get a converged guess <span style="font-weight: bold;">for</span> HF
#              =======================================
&lt;&lt;dft-incar&gt;&gt;
EOF
$VASP
cp OUTCAR OUTCAR.DFT

cat &lt;&lt;EOF | tee INCAR
#                          ================
<span style="font-weight: bold;">#                          RUN</span> Hartree-Fock
#                          ================
&lt;&lt;hf-incar&gt;&gt;
EOF
$VASP
cp OUTCAR OUTCAR.HF


nb=$(awk &lt;OUTCAR <span style="font-weight: bold;">'</span>
      /maximum number of plane-waves:/ {
       print $5*2-1
      }
    <span style="font-weight: bold;">'</span>)




cat &lt;&lt;EOF | tee INCAR
#              ========================================
<span style="font-weight: bold;">#              Diagonalize</span> Fock Operator with all bands
#              ========================================
&lt;&lt;hf-diagonalization-incar&gt;&gt;
EOF
$VASP
cp OUTCAR OUTCAR.HFdiag



cat &lt;&lt;EOF | tee INCAR
#                ====================================
<span style="font-weight: bold;">#                Dump</span> CC4S input using $nb bands.
#                ====================================
&lt;&lt;cc4s-incar&gt;&gt;
EOF
$VASP
cp OUTCAR OUTCAR.CC4S


cat &lt;&lt;EOF | tee cc4s.in
#                     =========================
<span style="font-weight: bold;">#                     Run</span> CC4S using $nb bands.
#                     =========================
&lt;&lt;cc4s-in&gt;&gt;
EOF

$CC4S -i cc4s.in | tee  cc4s.stdout
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-11-15 Mon 12:49</p>
</div>
</body>
</html>
